
//
// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых,
// заданных уравнениями y = k1 * x + b1, y = k2 * x + b2;
// значения b1, k1, b2 и k2 задаются пользователем.
// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)
//
// В процессе решения задачи проверим координаты точек на перпендикулярность,
// параллельность и совпадение прямых, если ничего не совпадает, то решаем задачу
// иначе выходим с сообщением.
//
// k1 * k2 = -1 - перпендикулярна
// k1 = k2 - параллельна
// k1 = = k2 и b1 = b2 - прямые совпадают
//


